import pandas as pd

countries = {
    "Україна": {"Населення": 41, "Площа": 603, "Частина світу": "Європа"},
    "Польща": {"Населення": 38, "Площа": 313, "Частина світу": "Європа"},
    "Німеччина": {"Населення": 83, "Площа": 357, "Частина світу": "Європа"},
    "Франція": {"Населення": 65, "Площа": 551, "Частина світу": "Європа"},
    "Іспанія": {"Населення": 47, "Площа": 505, "Частина світу": "Європа"},
    "Канада": {"Населення": 38, "Площа": 998, "Частина світу": "Америка"},
    "Бразилія": {"Населення": 214, "Площа": 851, "Частина світу": "Америка"},
    "Китай": {"Населення": 1410, "Площа": 959, "Частина світу": "Азія"},
    "Індія": {"Населення": 1390, "Площа": 328, "Частина світу": "Азія"},
    "Австралія": {"Населення": 26, "Площа": 769, "Частина світу": "Австралія"},
}

print("\nВміст словника:")
for country, info in countries.items():
    print(country, info)

df = pd.DataFrame.from_dict(countries, orient="index")
print("\nDataFrame:")
print(df)

print("\nПерші 3 рядки:")
print(df.head(3))
print("\nТипи даних:")
print(df.dtypes)
print("\nКількість рядків і стовпців:")
rows, cols = df.shape
print(f"[{rows} рядків та {cols} стовпці]")
print("\nОписова статистика:")
print(df.describe())

df["Щільність"] = df["Населення"] / df["Площа"]
print("\nРозрахунок щільності населення:")
print(df)

print("\nКраїни з площею більше 500 тис. км²:")
print(df[df["Площа"] > 500])

print("\nСортування за спаданням населення:")
print(df.sort_values("Населення", ascending=False))

print("\nСередня площа країн у кожній частині світу:")
print(df.groupby("Частина світу")["Площа"].mean())
print("\nМаксимальне населення в кожній частині світу:")
print(df.groupby("Частина світу")["Населення"].max())
print("\nКількість унікальних країн у списку:")
print(df.index.nunique())